app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    if @post.save
---
INSERT INTO "posts" ("created_at", "sef", "text", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Tue, 26 Nov 2013 12:43:41 UTC +00:00], ["sef", "lodo"], ["text", "Здесь большой текст"], ["title", "Это ЛОдо!"], ["updated_at", Tue, 26 Nov 2013 12:43:41 UTC +00:00]]

def show
  @post = Post.find(params[:sef])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]

def update
  @post = Post.find(params[:id])

  if @post.update(post_params)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "posts" SET "title" = ?, "updated_at" = ? WHERE "posts"."id" = 3  [["title", "3 материал"], ["updated_at", Mon, 25 Nov 2013 16:36:14 UTC +00:00]]